#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/dcentric-health/dev-vault-gh-actions/runs/run-pDoeSqFWWmp8rgSe

Waiting for the plan to start...

Terraform v1.3.7
on linux_amd64
Initializing plugins and modules...
data.aws_ami.selected: Reading...
data.aws_vpc.default: Reading...
data.aws_ami.selected: Read complete after 0s [id=ami-0b54cc6ff9f752b92]
data.aws_vpc.default: Read complete after 0s [id=vpc-ff49b386]
data.aws_subnet_ids.all: Reading...
module.loadbalancer_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-02b8d16426345d0f6]
module.alb.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:277142373668:targetgroup/api-20230201174506216800000001/78ff7484fa7f273c]
module.instance_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-04c6b6182db5d96ef]
module.loadbalancer_sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-1712345138]
module.loadbalancer_sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-4242469831]
data.aws_subnet_ids.all: Read complete after 1s [id=vpc-ff49b386]
module.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:277142373668:loadbalancer/app/vault-dev-stack/b4b9b83012f89a85]
module.instance_sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-4021357594]
module.instance_sg.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-3419748485]
aws_launch_template.this: Refreshing state... [id=lt-00d0c94022e74fd3e]
module.instance_sg.aws_security_group_rule.computed_ingress_with_source_security_group_id[0]: Refreshing state... [id=sgrule-2285027880]
module.alb.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:277142373668:listener/app/vault-dev-stack/b4b9b83012f89a85/953e76ba4e9a578e]
aws_cloudformation_stack.this: Refreshing state... [id=arn:aws:cloudformation:eu-west-1:277142373668:stack/vault-dev-stack/a1b08a30-a13a-11ed-a5b0-0af47ae69fd5]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.alb.aws_lb_target_group.main[0] has changed
  ~ resource "aws_lb_target_group" "main" {
        id                                 = "arn:aws:elasticloadbalancing:eu-west-1:277142373668:targetgroup/api-20230201174506216800000001/78ff7484fa7f273c"
        name                               = "api-20230201174506216800000001"
        tags                               = {
            "Name" = "api-"
        }
        # (16 unchanged attributes hidden)

      ~ health_check {
          ~ enabled             = false -> true
          ~ matcher             = "200-401" -> "200-402"
            # (7 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_cloudformation_stack.this will be updated in-place
  ~ resource "aws_cloudformation_stack" "this" {
        id                 = "arn:aws:cloudformation:eu-west-1:277142373668:stack/vault-dev-stack/a1b08a30-a13a-11ed-a5b0-0af47ae69fd5"
        name               = "vault-dev-stack"
        tags               = {}
      ~ template_body      = <<-EOT
            Resources:
              ASG:
                Type: AWS::AutoScaling::AutoScalingGroup
                Properties:
                  AutoScalingGroupName: "vault-dev-stack"
                  HealthCheckGracePeriod: 300
                  DesiredCapacity: 2
                  MaxSize: 2
                  MinSize: 2
                  VPCZoneIdentifier: ["subnet-51d5e237","subnet-5315131b","subnet-6d0f7f37"]
                  TargetGroupARNs: ["arn:aws:elasticloadbalancing:eu-west-1:277142373668:targetgroup/api-20230201174506216800000001/78ff7484fa7f273c"]
                  Tags: []
                  HealthCheckType: EC2
            
                  MixedInstancesPolicy:
                    InstancesDistribution:
                      OnDemandBaseCapacity: 0
                      OnDemandPercentageAboveBaseCapacity: 0
                      SpotAllocationStrategy: capacity-optimized
                    LaunchTemplate:
                      LaunchTemplateSpecification:
                        LaunchTemplateName: "vault-dev-stack20230131073807735800000004"
                        Version: "10"
                      Overrides: []
            
                UpdatePolicy:
                  AutoScalingScheduledAction:
                    IgnoreUnmodifiedGroupSizeProperties: true
                  AutoScalingRollingUpdate:
                    PauseTime: PT6M
                    SuspendProcesses:
                      - HealthCheck
                      - ReplaceUnhealthy
                      - AZRebalance
                      - AlarmNotification
                      - ScheduledActions
                DeletionPolicy: Delete
        EOT -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_launch_template.this will be updated in-place
  ~ resource "aws_launch_template" "this" {
        id                      = "lt-00d0c94022e74fd3e"
      ~ image_id                = "ami-0b2daee24ce8da4c6" -> "ami-0b54cc6ff9f752b92"
      ~ latest_version          = 11 -> (known after apply)
        name                    = "vault-dev-stack20230131073807735800000004"
        tags                    = {}
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.alb.aws_lb_listener.frontend_http_tcp[0] will be updated in-place
  ~ resource "aws_lb_listener" "frontend_http_tcp" {
        id                = "arn:aws:elasticloadbalancing:eu-west-1:277142373668:listener/app/vault-dev-stack/b4b9b83012f89a85/953e76ba4e9a578e"
        tags              = {}
        # (5 unchanged attributes hidden)

      ~ default_action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:277142373668:targetgroup/api-20230201174506216800000001/78ff7484fa7f273c" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.alb.aws_lb_target_group.main[0] must be replaced
+/- resource "aws_lb_target_group" "main" {
      ~ arn                                = "arn:aws:elasticloadbalancing:eu-west-1:277142373668:targetgroup/api-20230201174506216800000001/78ff7484fa7f273c" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/api-20230201174506216800000001/78ff7484fa7f273c" -> (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:eu-west-1:277142373668:targetgroup/api-20230201174506216800000001/78ff7484fa7f273c" -> (known after apply)
      ~ ip_address_type                    = "ipv4" -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ name                               = "api-20230201174506216800000001" -> (known after apply)
      ~ name_prefix                        = "api-" -> "vault-" # forces replacement
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
      ~ tags                               = {
          ~ "Name" = "api-" -> "vault-"
        }
      ~ tags_all                           = {
          ~ "Name" = "api-" -> "vault-"
        }
        # (9 unchanged attributes hidden)

      ~ health_check {
          ~ healthy_threshold   = 3 -> 2
          ~ matcher             = "200-402" -> "200-499"
          ~ unhealthy_threshold = 3 -> 6
            # (6 unchanged attributes hidden)
        }

      ~ stickiness {
          ~ cookie_duration = 86400 -> (known after apply)
          + cookie_name     = (known after apply)
          ~ enabled         = false -> (known after apply)
          ~ type            = "lb_cookie" -> (known after apply)
        }

      ~ target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }
    }

Plan: 1 to add, 3 to change, 1 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
│ but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-pDoeSqFWWmp8rgSe/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-pDoeSqFWWmp8rgSe/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Deprecated Resource
│ 
│   with data.aws_subnet_ids.all,
│   on data.tf line 5, in data "aws_subnet_ids" "all":
│    5: data "aws_subnet_ids" "all" {
│ 
│ The aws_subnet_ids data source has been deprecated and will be removed in a
│ future version. Use the aws_subnets data source instead.
│ 
│ (and one more similar warning elsewhere)
╵

```

</details>

*Pushed by: @linerocks, Action: `pull_request`*